Tekla Open API Reference for Tekla Structures 2025
Connection.GetSecondaryObjects Method
 Returns the secondary objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetSecondaryObjects()
Public Function GetSecondaryObjects As ArrayList
Return Value
Type: ArrayList
An array list containing all the secondary objects.
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace